## Plan for api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
        id                    = "ags-s50ry4jhg5-v1"
        tags                  = {}
      - xray_tracing_enabled  = true -> null
        # (9 unchanged attributes hidden)
    }

  # module.rds.aws_db_proxy.proxy will be updated in-place
  ~ resource "aws_db_proxy" "proxy" {
      ~ debug_logging          = true -> false
        id                     = "scan-websites-proxy"
        name                   = "scan-websites-proxy"
        tags                   = {
            "CostCentre" = "scan-websites-production"
            "Name"       = "scan-websites-rds-proxy"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)

      - auth {
          - auth_scheme = "SECRETS" -> null
          - iam_auth    = "DISABLED" -> null
          - secret_arn  = "arn:aws:secretsmanager:ca-central-1:507252742351:secret:scan-websites-zl9eef-rbIlJ9" -> null
        }
      + auth {
          + auth_scheme = "SECRETS"
          + description = "The postgresql connection string"
          + iam_auth    = "DISABLED"
          + secret_arn  = "arn:aws:secretsmanager:ca-central-1:507252742351:secret:scan-websites-zl9eef-rbIlJ9"
        }
    }

  # module.rds.aws_secretsmanager_secret_version.connection_string must be replaced
-/+ resource "aws_secretsmanager_secret_version" "connection_string" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:507252742351:secret:scan-websites-zl9eef-rbIlJ9" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:507252742351:secret:scan-websites-zl9eef-rbIlJ9|1D9D350C-125C-411F-B9C0-271C6D5E17F6" -> (known after apply)
      - secret_binary  = (sensitive value)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "1D9D350C-125C-411F-B9C0-271C6D5E17F6" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>